added murmaid diagram to readme
